ChartsOfCharacteristicTypes/гф_ГлобальныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>гф_ГлобальныеЗначения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.гф_ГлобальныеЗначения</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеХЗ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Список</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:Characteristic.гф_ГлобальныеЗначения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

ChartsOfCharacteristicTypes/гф_ГлобальныеЗначения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.Ключ.ОтображениеПредупрежденияПриРедактировании = ОтображениеПредупрежденияПриРедактировании.НеОтображать;
	КонецЕсли;
	
	Если Объект.ТипЗначения.Типы().Количество() > 1 Тогда
		Объект.ТипЗначения = новый ОписаниеТипов("СправочникСсылка.Контрагенты");
		Объект.Значение = Элементы.Значение.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
	КонецЕсли;
	вУстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервере
Процедура вУстановитьВидимостьДоступность()
	Возврат;
	
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	пРежимСписка = ВРег(Прав(Объект.Ключ, 7)) = "_СПИСОК";
	
	Если не пРежимСписка Тогда
		Элементы.Список.ТолькоПросмотр = истина;
	Иначе
		Элементы.Список.ТолькоПросмотр = ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КлючПриИзменении(Элемент)
	вУстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененоГлобальноеЗначение", Объект.Ссылка);
КонецПроцедуры
